<a href="https://colab.research.google.com/github/Rahullnitp/Data_Cleaning_And_Preprocessing/blob/master/Data_Creation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Dataset creation

In [0]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

####i).Data creation using "random.randn"

       
randn create a dataset with normal distribution with mean = 0 and variance = 1.

In [0]:
#dataset with 1000 rows and 4 columns
data=pd.DataFrame(np.random.randn(1000,4),columns=list('ABCD'))

In [4]:
data.head()

          A         B         C         D
0  2.180733 -0.296313 -0.617577  0.339535
1 -0.603106 -1.276699 -0.184112 -0.972527
2 -0.940973  0.617654  0.030766  0.980758
3 -0.306400 -0.090558  0.193454 -0.985175
4 -0.489383  1.515001  0.732845  2.126190

###ii).Data Creation using "random.randint"

Return random integers from the “discrete uniform” distribution of the specified dtype in the “half-open” interval [low, high). If high is None (the default), then results are from [0, low).

In [0]:
data1=pd.DataFrame(np.random.randint(0,100,size=(1000,4)),columns=list('ABCD'))

In [6]:
data1.head()

    A   B   C   D
0   8  84  93  34
1   9  70  57  87
2  35  56   3  38
3  16   7  20  70
4  63  56  26  48

###iii).Data creation with some null values in it.

create a dataframe with approximately 10% null values.

In [0]:
data_null=pd.DataFrame(np.random.randn(1000,4),columns=list('ABCD'))

In [8]:
data_null.head()

          A         B         C         D
0 -0.119415 -0.521634  0.822300 -0.331749
1  2.080145 -0.841655 -0.773028 -0.543947
2  1.531877 -0.401157  0.921410 -0.092921
3 -0.909230 -0.657683  0.539942  0.633080
4 -1.611440  0.383540  2.719637  0.620029

In [0]:
data_null = data_null.mask(np.random.random(data_null.shape)< .1)   # difference bn "random.random" and "random.randn" by this link --https://stackoverflow.com/questions/47231852/np-random-rand-vs-np-random-random

In [10]:
data_null.head()

          A         B         C         D
0 -0.119415 -0.521634  0.822300       NaN
1       NaN -0.841655 -0.773028       NaN
2  1.531877       NaN       NaN -0.092921
3 -0.909230 -0.657683  0.539942  0.633080
4       NaN  0.383540  2.719637  0.620029

###iv).Data with some categorical features

create a column with some categorical values

In [0]:
data_null['category'] = np.random.choice(a=['A', 'B', 'C', 'D'],size=1000,p=[0.4, 0.3, 0.2,0.1]  )  #adding a categorical feature .

In [12]:
data_null.head()

          A         B         C         D category
0 -0.119415 -0.521634  0.822300       NaN        B
1       NaN -0.841655 -0.773028       NaN        A
2  1.531877       NaN       NaN -0.092921        D
3 -0.909230 -0.657683  0.539942  0.633080        C
4       NaN  0.383540  2.719637  0.620029        B